[
  {
    "name": "TURTLEBOT4",
    "pkg": "turtlebot4_node",
    "node": "/tmp/turtlebot4",
    "abstract": "TurtleBot 4 is the latest generation of the open-source robotics platform designed for education and research, featuring improved computing power, advanced sensors, and an exceptional user experience. It serves as a comprehensive development and learning platform, equipped with an iRobot® Create® 3 mobile base, a Raspberry Pi 4, an OAK-D stereo camera, 2D LiDAR, and more, enabling users to jumpstart their robotics journey."
  },
  {
    "name": "JoyTeleop",
    "pkg": "turtlebot4_bringup",
    "node": "joy_teleop",
    "launchOption": "namespace:=/",
    "abstract": "Enables manual control of the TurtleBot 4 using a joystick. This node interfaces with a physical joystick device, publishing commands based on user inputs to control the robot's movements and actions, enhancing human-robot interaction capabilities."
  },
  {
    "name": "LiteConfiguration",
    "pkg": "turtlebot4_bringup",
    "node": "lite",
    "abstract": "Initiates a lightweight configuration for TurtleBot 4, optimizing resource usage for basic operations. Designed for minimal hardware setups, this launch simplifies the robot's functionalities to core components, ensuring efficient performance under constrained conditions."
  },
  {
    "name": "OAKDCamera",
    "pkg": "turtlebot4_bringup",
    "node": "oakd",
    "launchOption": "namespace:=/",
    "abstract": "Launches the OAK-D camera nodes on TurtleBot 4, enabling advanced visual capabilities. This setup includes depth perception, 3D mapping, and object recognition, significantly enhancing the robot's environmental awareness and interaction potential."
  },
  {
    "name": "OAKDCameraExample",
    "pkg": "turtlebot4_bringup",
    "node": "oakd_example",
    "launchOption": "namespace:=/",
    "abstract": "Provides an example configuration for utilizing TurtleBot 4's OAK-D camera, demonstrating its capabilities in depth sensing and visual data processing. This launch serves as a practical guide for developers to explore and integrate OAK-D functionalities into custom applications."
  },
  {
    "name": "RobotBasicFunctions",
    "pkg": "turtlebot4_bringup",
    "node": "robot",
    "abstract": "Initializes the basic functions necessary for TurtleBot 4 operation, including sensor activation, motor control, and communication interfaces. This foundational launch ensures that the robot's essential systems are online and ready for further customization and control."
  },
  {
    "name": "RPLidarSensor",
    "pkg": "turtlebot4_bringup",
    "node": "rplidar",
    "abstract": "Integrates the RPLidar sensor with TurtleBot 4, providing 360-degree laser range scanning for obstacle detection and navigation. This launch enhances the robot's spatial awareness and safety, facilitating precise movements and environment mapping."
  },
  {
    "name": "StandardConfiguration",
    "pkg": "turtlebot4_bringup",
    "node": "standard",
    "abstract": "Activates the standard configuration for TurtleBot 4, balancing performance and functionality. This comprehensive launch includes a full suite of sensors and capabilities, making it suitable for a wide range of applications from research to entertainment."
  },
  {
    "name": "Turtlebot4_Lidar",
    "pkg": "rplidar_ros",
    "node": "rplidar",
    "abstract": "The Turtlebot4 Lidar node, powered by the RPLIDAR package, integrates a 2D LiDAR sensor with TurtleBot 4, enhancing its navigation and mapping capabilities. This setup is crucial for a wide range of robotic applications, from obstacle avoidance to SLAM (Simultaneous Localization and Mapping), facilitating precise localization and environmental mapping."
  },
  {
    "name": "PointCloud",
    "pkg": "stereo_image_proc",
    "node": "stereo_image_proc",
    "abstract": "The PointCloud node, utilizing the stereo_image_proc package, generates 3D point clouds from stereo images captured by TurtleBot 4's OAK-D camera. This functionality is instrumental in 3D mapping and environment understanding, enabling advanced robotic applications such as object recognition, space measurement, and navigation in complex environments."
  },
  {
    "name": "DepthAI_Mobilenetnode",
    "pkg": "depthai_examples",
    "node": "mobile_publisher",
    "abstract": "The DepthAI_Mobilenetnode, leveraging the depthai_examples package, integrates MobileNet SSD object detection with TurtleBot 4, utilizing its OAK-D camera for real-time object detection and classification. This node is crucial for developing intelligent robotic applications that require the ability to recognize and interact with objects in their surroundings."
  },
  {
    "name": "DepthAI_stereonode",
    "pkg": "depthai_examples",
    "node": "stereo",
    "abstract": "The DepthAI_stereonode, part of the depthai_examples package, harnesses stereo vision capabilities of TurtleBot 4's OAK-D camera to perform depth estimation. This node is essential for applications needing accurate distance measurements to navigate safely and interact effectively with the environment."
  },
  {
    "name": "DepthAI_rgb_stereo_node",
    "pkg": "depthai_examples",
    "node": "rgb_stereo_node",
    "abstract": "The DepthAI_rgb_stereo_node, using the depthai_examples package, combines RGB and stereo data from TurtleBot 4's OAK-D camera for enhanced depth perception and color imaging. This integration is vital for applications that require detailed environmental understanding and object recognition, providing a rich dataset for complex robotic tasks."
  },
  {
    "name": "DepthAI_rgb_publisher",
    "pkg": "depthai_examples",
    "node": "rgb_publisher",
    "abstract": "The DepthAI_rgb_publisher node, a part of the depthai_examples package, is responsible for publishing RGB images from TurtleBot 4's OAK-D camera. This node facilitates the capture and dissemination of high-quality RGB images, enabling the development of applications that rely on color vision, such as object detection, recognition, and environment monitoring."
  }
]
